# int - 정수형
# 소수점 없이 딱 떨어지는 수
# 0 과 음수도 정수에 포함됨

count = 3
age = 27
tall = 160
zero = 0
temp = -30

# ========================================================

# float - 실수
# 소수점이 붙은 숫자
# 5.0 과 같이 딱 떨어지는 수 이지만 소수점이 있다면 무조건 float

tired = 99.999999
height = 17.2


# =======================================================

# str - 문자열
# 따옴표에 감싸져 있는 모든 값

hello = "안녕하세요 !"
emoji = "❤️"
empty = ""  # 따옴표 안에 아무것도 작성되지 않아도 str (빈 문자열)
fake_num = "12345"
fake_num2 = "5.0"

illit = "It's me"
# 따옴표가 ""와 '' 둘 다 사용 할 수 있는 이유는 문자열 안에 따옴표가 필요한 경우가 있기 때문
# 이럴 경우 사용하지 않는 따옴표로 쌍을 맞춰 가장 바깥에 감싸줌

# ===================================================================

# bool - 불리언형
# True 또는 False 두 형태만 존재
# 첫 글자는 대문자, 따옴표 없이 작성

ok = True
no = False

# 비교할 경우 bool로 출력
print(100 < 5)  # False
print(5 == 5)  # True



