import pandas as pd

df = pd.read_csv("data/14_hydraulic.csv", encoding="utf-8")

# corr 한 줄로 계산하는 상관계수 : correlation
cor1 = df["온도"].corr(df["진동"])
print(cor1)  # 0.9307966383117148
print(cor1.round(3))
print(round(cor1, 3))
print(round(df["온도"].corr(df["진동"]), 3))
print(df["온도"].corr(df["진동"]).round(3))


print(df["온도"].corr(df["압력"]).round(3))  # 0.284
print(df["진동"].corr(df["압력"]).round(3))  # 0.524


# 세가지 동시에 비교하는 법
num = df[["온도", "진동", "압력"]]
print(num.corr().round(3))
#        온도     진동     압력
# 온도  1.000  0.931  0.284
# 진동  0.931  1.000  0.524
# 압력  0.284  0.524  1.000

import pandas as pd

df_qc = pd.read_csv("data/14_hydraulic_qc.csv", encoding="utf-8")
df_qc.info()

r1 = df_qc["지표07"].corr(df_qc["지표08"])
print("지표07-08 상관관계 :", r1, "강한 음의 상관관계~")  # -0.96908773235797
print(r1.round(3))  # -0.969

cols = [
    "지표01",
    "지표02",
    "지표03",
    "지표04",
    "지표05",
    "지표06",
    "지표07",
    "지표08",
    "지표09",
    "지표10",
]

r2 = df_qc[cols].corr()
print(r2.round(2))

#       지표01  지표02  지표03  지표04  지표05  지표06  지표07  지표08  지표09  지표10
# 지표01  1.00  0.94  0.72 -0.98 -0.90  0.33 -0.88  0.76 -0.96  1.00
# 지표02  0.94  1.00  0.80 -0.94 -0.93  0.48 -0.92  0.84 -0.96  0.94
# 지표03  0.72  0.80  1.00 -0.71 -0.95  0.89 -0.96  0.99 -0.88  0.70
# 지표04 -0.98 -0.94 -0.71  1.00  0.89 -0.33  0.87 -0.75  0.95 -0.98
# 지표05 -0.90 -0.93 -0.95  0.89  1.00 -0.71  1.00 -0.97  0.98 -0.88
# 지표06  0.33  0.48  0.89 -0.33 -0.71  1.00 -0.73  0.85 -0.57  0.30
# 지표07 -0.88 -0.92 -0.96  0.87  1.00 -0.73  1.00 -0.97  0.98 -0.87
# 지표08  0.76  0.84  0.99 -0.75 -0.97  0.85 -0.97  1.00 -0.91  0.74
# 지표09 -0.96 -0.96 -0.88  0.95  0.98 -0.57  0.98 -0.91  1.00 -0.95
# 지표10  1.00  0.94  0.70 -0.98 -0.88  0.30 -0.87  0.74 -0.95  1.00
